Creando Estructuras de Datos

In [1]:
import pandas as pd

SERIES

In [3]:
data=[1,2,3,4,5]

In [4]:
#para crear una serie usamos la clase Series
s=pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#podemos darle nuevos valores de indices a nuestra serie asi
index=['linea' + str(i) for i in range(5)]
index

['linea0', 'linea1', 'linea2', 'linea3', 'linea4']

In [6]:
#ahora para pasarle estos indices a nuestra serie se lo indicamos con un segundo parametro llamado index
s=pd.Series(data=data,index=index)
s

linea0    1
linea1    2
linea2    3
linea3    4
linea4    5
dtype: int64

In [7]:
#podemos generar una serie a partir de un diccionario python,creamos un diccionario
data={'linea' + str(i) : i+1 for i in range(5)}
data

{'linea0': 1, 'linea1': 2, 'linea2': 3, 'linea3': 4, 'linea4': 5}

In [8]:
#generamos la serie con nuestro diccionario
s=pd.Series(data)
s

linea0    1
linea1    2
linea2    3
linea3    4
linea4    5
dtype: int64

interacciones entre diccionarios

In [9]:
#podemos aumentar los valores de los elementos de la primera serie en 2, asi tendremoa 2 series distintas
s1=s+2
s1

linea0    3
linea1    4
linea2    5
linea3    6
linea4    7
dtype: int64

In [10]:
#podemos hacer operaciones aritmeticas entre series, si las series tiene los mismos indices puedo hacer operaciones entre estos indices que son iguales.Si los indices no son iguales parecera NaN
s2=s1+s
s2

linea0     4
linea1     6
linea2     8
linea3    10
linea4    12
dtype: int64

Concatenando dataframes

In [11]:
#vamos a crear una lista de listas
data=[[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [12]:
#generamos un dataframe de esta lista
df1=pd.DataFrame(data=data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
#manipulamos los indices para presentarlos mejor
index=['Linea' + str(i) for i in range(3)]
index

['Linea0', 'Linea1', 'Linea2']

In [14]:
#generamos de nuevo nuestro df pasandole estos nuevos indices en vez de los generados por default
df1=pd.DataFrame(data=data,index=index)
df1

        0  1  2
Linea0  1  2  3
Linea1  4  5  6
Linea2  7  8  9

In [15]:
#podemos hacer lo mismo para las columnas
columns=['Columna' + str(i) for i in range(3)]
columns

['Columna0', 'Columna1', 'Columna2']

In [16]:
#le pasamos un nuevo parametro para las columnas
df1=pd.DataFrame(data=data,index=index,columns=columns)
df1

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

crear df a partir de un diccionario

In [17]:
#las llaves del diccionario seran las columnas y los valores seran las filas
data={
    'Columna0':{'Linea0':1,'Linea1':4,'Linea2':7},
    'Columna1':{'Linea0':2,'Linea1':5,'Linea2':8},
    'Columna2':{'Linea0':3,'Linea1':6,'Linea2':9},
    }
data

{'Columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'Columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'Columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [18]:
#creamos el df a partir de este diccionario
df2=pd.DataFrame(data)
df2

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

generar df a partir de una lista de tuplas

In [22]:
data=[(1,2,3),(4,5,6),(7,8,9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [23]:
#creamos el df a partir de esta lista de tuplas
df3=pd.DataFrame(data,index=index,columns=columns)
df3

        Columna0  Columna1  Columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

operaciones con nuestro df

In [24]:
#vamos a sustituir los valores numericos del df1 por el vlor 'A',osea por string,para esto le indicamos la condicion de que todos los valores del df1 mayores a 0 seran sustituidos por el valor 'A'
df1[df1>0]='A'
df1

C:\Users\User\AppData\Local\Temp\ipykernel_4016\864643913.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1[df1>0]='A'

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A

In [25]:
#hacemos lo  ismo con el df2
df2[df2>0]='B'
df2

C:\Users\User\AppData\Local\Temp\ipykernel_4016\3793174249.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2>0]='B'

       Columna0 Columna1 Columna2
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B

In [26]:
#lo ismo para df3
df3[df3>0]='C'
df3

C:\Users\User\AppData\Local\Temp\ipykernel_4016\1311048455.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3>0]='C'

       Columna0 Columna1 Columna2
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [27]:
#ahora podemos concatenar estos 3 df usando el metodo concat(),dentro de los parentesis le paso una lista con los df,vermos que unira en un solo df los valores de los 3. Aqui no me tira la advertencia de los otros anteriores porque los tipos de datos son iguales.
df4=pd.concat([df1,df2,df3])
df4

       Columna0 Columna1 Columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [28]:
#si quiero concatenar pero por las columnas,osea horizontalmente,utilizo un segundo parametro llamado axis y le paso el valor 1,lo cual indica que concatenara las filas
df5=pd.concat([df1,df2,df3],axis=1)
df5

,Columna0,Columna1,Columna2,Columna0,Columna1,Columna2,Columna0,Columna1,Columna2
Linea0,A,A,A,B,B,B,C,C,C
Linea1,A,A,A,B,B,B,C,C,C
Linea2,A,A,A,B,B,B,C,C,C